<template>
  <DashBoardLayout>
    <div class="sectionsPadding sectionHeight">
      <section-header></section-header>
      <h1>المدونة</h1>
      <b-row align-h="center">
        <b-col md="10" class="text-dark pb-5">
          <h5 class="px-2 text-justify">
            هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا
            النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد
            من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
          </h5>
        </b-col>
      </b-row>
      <div v-if="blogs.length">
        <b-row align-h="center" class="py-5">
          <b-col md="4" class="pb-4" v-for="blog in blogs" :key="blog.id">
            <blog-card
              :id="blog.id"
              :blogTitle="blog.blogTitle"
              :blogDatee="blog.blogDatee"
              :blogText="blog.blogText"
              :blogImgSrc="blog.blogImgSrc"
            >
            </blog-card>
          </b-col>
        </b-row>
      </div>
      <div v-else class="sectionsPadding">
        <h4 class="p-5 m-5">جاري التحميل...</h4>
      </div>
    </div>
  </DashBoardLayout>
</template>

<script>
import DashBoardLayout from "@/layouts/dashBoardLayout";
import sectionHeader from "@/components/sectionHeader.vue";
import blogCard from "@/components/blogCards.vue";

export default {
  name: "Blogs",
  components: {
    DashBoardLayout: DashBoardLayout,
    "section-header": sectionHeader,
    "blog-card": blogCard,
  },
  data: function () {
    return {
      blogs: [
        {
          id: 1,
          blogTitle: "جزر فرسان",
          blogDatee: "1 صفر 1443",
          blogText:
            "حافظت “جزيرة فرسان” جنوب غربي السعودية طيلة الفترة الماضية على مكانتها في أن تكون بقعة من الضوء شاسعة في محيط البحر الأحمر، حين ضمت جزرها الواسعة معالم الدهشة على شواطئها ذات الرمال البيضاء، واحتوت كنوزا من اللؤلؤ في قلب العمق التاريخي الذي تحمله الجزيرة، كما لفتها غابات.  هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق. طقس جزيرة فرسان هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى. إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.حافظت “جزيرة فرسان” جنوب غربي السعودية طيلة الفترة الماضية على مكانتها في أن تكون بقعة من الضوء شاسعة في محيط البحر الأحمر، حين ضمت جزرها الواسعة معالم الدهشة على شواطئها ذات الرمال البيضاء، واحتوت كنوزا من اللؤلؤ في قلب العمق التاريخي الذي تحمله الجزيرة، كما لفتها غابات .",
          blogImgSrc: "blog1.png",
        },
        {
          id: 2,
          blogTitle: "العنوان الثاني",
          blogDatee: "25 جمادى الأول 1442",
          blogText:
            "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف إضافة إلى زيادة عدد الحروف إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.",
          blogImgSrc: "blog2.png",
        },
        {
          id: 3,
          blogTitle: "العنوان الثالث",
          blogDatee: "14 رمضان 1440",
          blogText:
            "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف إضافة إلى زيادة عدد الحروف إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.",
          blogImgSrc: "blog3.png",
        },
        {
          id: 4,
          blogTitle: "العنوان الرابع",
          blogDatee: "14 رمضان 1440",
          blogText:
            "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف إضافة إلى زيادة عدد الحروف إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.",
          blogImgSrc: "blog3.png",
        },
        {
          id: 5,
          blogTitle: "العنوان الخامس",
          blogDatee: "14 رمضان 1440",
          blogText:
            "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف إضافة إلى زيادة عدد الحروف إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.",
          blogImgSrc: "blog1.png",
        },
        {
          id: 6,
          blogTitle: "العنوان السادس",
          blogDatee: "14 رمضان 1440",
          blogText:
            "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف إضافة إلى زيادة عدد الحروف إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.",
          blogImgSrc: "blog2.png",
        },
      ],
    };
  },
  /*mounted(){
    fetch('http://localhost:3000/blogs')
    .then(res => res.json)
    .then(data => this.blogs = data)
    .catch(err => console.log(err.message))
  }*/
};
</script>
<style></style>
