<template>
<b-container>
    <b-row class="blogImgViewMore" align-v="center" align-h="center">
        <div>
            <h1 style="color:white;">جزر فرسان</h1>
            <p class="text-white">15 ذو الحجة 1442</p>  
        </div>
    </b-row>
    <b-container class="sectionsPadding">
        <!--<b-row>
            <b-col md='8' class="py-4 px-2 text-left">
                <p class="blogParagraph">حافظت “جزيرة فرسان” جنوب غربي السعودية طيلة الفترة الماضية على مكانتها في أن تكون بقعة من الضوء شاسعة في محيط البحر الأحمر، حين ضمت جزرها الواسعة معالم الدهشة على شواطئها ذات الرمال البيضاء، واحتوت كنوزا من اللؤلؤ في قلب العمق التاريخي الذي تحمله الجزيرة، كما لفتها غابات</p>
                <p class="blogParagraph">هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف ..</p>
                <img src="../../public/img/farasan.png" alt="Farasan">
                <p class="blogParagraph">هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف ..</p>
                <p class="blogParagraph">هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف ..</p>
                <p class="blogParagraph">هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف ..</p>
            </b-col>
            <b-col md='4'>
                <br>
                <h2>إقرأ أكثر عن</h2>
            </b-col>
        </b-row>-->
    </b-container>
</b-container>

</template>

<style>
.blogParagraph{
    font-size: 25px !important;
    padding: 1.5rem 0;
}
</style>